{
  "id": "job_20170202005749_R8YIO6XJGRFQEQ3V",
  "team_id": "",
  "title": "DevOps Engineer (Remote)",
  "country_id": "United States",
  "city": "Sacramento",
  "state": "CA",
  "zip": "95833",
  "department": "",
  "description": "<p>CivicActions is a dedicated, fun-loving team, looking for some talented folks to help us bring revolutionary digital services to government agencies and the people they serve.</p>\n\n<p><span style=\"font-size:16px;\"><strong>Responsibilities &amp; Qualifications</strong></span></p>\n\n<p>For this position, we need people with experience in:</p>\n\n<ul>\n<li>Continuous integration &amp; continuous deployment</li>\n<li>Infrastructure-as-code based configuration management</li>\n<li>Amazon Web Services environment</li>\n<li>Agile Development environments</li>\n<li>Creating and maintaining documentation</li>\n<li>Understanding of systems and network architecture</li>\n<li>Working with cross-functional teams (users, developers, product managers)</li>\n<li>Breaking down complex problems into understandable and iterative solutions</li>\n</ul>\n\n<p>\n<br /><strong>Technologies Used</strong></p>\n\n<p>We use the following stack for this project:</p>\n\n<ul>\n<li>Free/Libre and open source software</li>\n<li>GNU/Linux</li>\n<li>Ansible</li>\n<li>AWS CloudFormation</li>\n<li>Docker</li>\n<li>Kubernetes</li>\n<li>Jenkins</li>\n<li>ElasticSearch</li>\n</ul>\n\n<p>&nbsp;</p>\n\n<p><span style=\"font-size:16px;\"><strong>Location</strong></span></p>\n\n<p>This position is remote, provided the candidate can do some onsite travel to the project location in Sacramento, CA.</p>\n\n<p>&nbsp;</p>\n\n<p><strong><span style=\"font-size:16px;\">Salary Range</span></strong>\n<br />\n<br />$89,000 - $127,000&nbsp;Annually\n<br />Salary commensurate with qualifications and experience.</p>\n\n<p>&nbsp;</p>\n\n<p><span style=\"font-size:16px;\"><strong>Benefits</strong></span></p>\n\n<p>We excel in our benefits offering and believe that people who are well taken care of can be more balanced, healthy and happy. We offer 100% company-paid medical insurance, disability insurance, and life insurance. We have a generous 401(k) program. We have an open vacation policy -- employees are encouraged to take time off as needed to feel balanced, productive and healthy. We have paid maternity and paternity leave. We have an annual all-hands retreat to connect with each other in person. We also emphasize professional development and offer an annual stipend.</p>\n\n<p>&nbsp;</p>\n\n<p>Community participation is important to us and we ask that you spend 5% of your working time giving back to a community that you care about. We attempt to keep our work products 'open by default'. This means that it is our intention that your work contributions during your time at CivicActions will be published under public license, enabling you to bring your passion fully into your activities without the fear that your expressions will be locked away or prevented from having a positive impact in the world.</p>\n\n<p>&nbsp;</p>\n\n<p><strong><span style=\"font-size:16px;\">About CivicActions</span></strong></p>\n\n<p>CivicActions is a digital services firm building elegant and accessible government services for everyone.</p>\n\n<p>We are passionate civic designers and developers specializing in free and open source agile software development, user-centered design, security/compliance and open data.</p>\n\n<p>We lead the efforts behind&nbsp;Agile Government Leadership&nbsp;(AGL) and&nbsp;Project DKAN. AGL brings together public sector IT leaders to help understand and implement Agile project management practices within government. Project DKAN is the global open source project that manages development and direction for the DKAN open data platform.</p>\n\n<p>In 2017, CivicActions was named to Government Technology’s esteemed&nbsp;GovTech 100&nbsp;list.</p>\n\n<p>&nbsp;</p>\n\n<p><span style=\"font-size:16px;\"><strong>Apply</strong></span></p>\n\n<p>We find strength and inspiration in the things that make each of us unique. In striving for a more diverse team, we strongly encourage women, people of color, and physically-challenged people to apply.</p>\n",
  "minimum_salary": "90000",
  "maximum_salary": "125000",
  "notes": "",
  "original_open_date": "2016-12-30",
  "type": "Full Time",
  "status": "Open",
  "send_to_job_boards": "Yes",
  "hiring_lead": "usr_20161101183836_3II7U26I272XMMZC",
  "board_code": "PICWyDkuO6",
  "internal_code": "CA ADPQ - 32196 (DevOps)",
  "questionnaire": "questionnaire_20170104230903_TOSTZMQGRCSYOGMI"
}